import random
import math

# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]
num_list = [2, -5, 8, 9, -25, 25, 4]
res_list = []

for itm in num_list:
    if itm > 0 and itm ** 0.5 % 1 == 0:
        res_list.append(int(itm ** 0.5))



# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)


date_string = '06.02.2019'
month_list = ["Января", "Февраля", "Марта", "Апреля", "Майя", "Июня", "Июля", "Августа", "Сентября", "Октября", "Ноября", "Декабря"]

day_list = ["первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое", "двенадцатое", "тренадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семьнадцатое", "восемьнадцатое", "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье", "двадцать четвертое", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое"]

day = day_list[int(date_string[0:2])].title()
month = month_list[int(date_string[3:5])].title()
year = date_string[6:] + 'г.'

print(day, month, year)




# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random


num_count = 20
random_list = []
i = 0
while i < num_count:
    random_list.append(random.randint(-100, 100))
    i +=1
print(random_list)


# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]

lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2 = []
for itm in lst:
    if itm not in lst2:
        lst2.append(itm)

    # либо так
    # if lst2.count(itm) == 0:
    #     lst2.append(itm)

# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2 = []

for itm in lst:
    if lst.count(itm) == 1:
        lst2.append(itm)